read_liberty config/gscl45nm.lib
read_verilog input/ver/adder_i8_o5_for_metrics.v
link_design top
create_clock -name clk -period 1
set_input_delay -clock clk 0 [all_inputs]
set_output_delay -clock clk 0 [all_outputs]
report_checks
report_power -digits 12
exit